<?php

declare(strict_types=1);

/*
 * +----------------------------------------------------------------------+
 * |                   At all timesI love the moment                      |
 * +----------------------------------------------------------------------+
 * | Copyright (c) 2019 www.Woisk.com All rights reserved.                |
 * +----------------------------------------------------------------------+
 * |  Author:  Maple Forest  <Woisks@126.com>   QQ:364956690   286013629  |
 * +----------------------------------------------------------------------+
 */
return [

    /**
     * 当天验证码未验证发送数量限制
     *  默认2次未验证,当天拒绝再次发送
     */
    'today_not_validate_send_limit' => 2,

    /**
     * 验证码过期时间
     * 默认设置20分钟有效期
     */
    'expire_time'                   => 20

];
