<?php

declare(strict_types=1);

/*
 * +----------------------------------------------------------------------+
 * |                   At all timesI love the moment                      |
 * +----------------------------------------------------------------------+
 * | Copyright (c) 2019 www.Woisk.com All rights reserved.                |
 * +----------------------------------------------------------------------+
 * |  Author:  Maple Forest  <Woisks@126.com>   QQ:364956690   286013629  |
 * +----------------------------------------------------------------------+
 */
return [

    /**
     * 注册验证码是否开启
     */
    'register_captcha_middleware' => false,
    /**
     * 登录错误次数触发限制登录
     * 默认 5 次触发条件
     */
    'login_error_numeric'         => 5,

    /**
     * 限制多长时间禁止登录
     * 默认 30 分钟
     */
    'limit_login_time_minute'     => 30,

    /**
     * 账号已禁用
     */
    'disable'                     => 0,

    /**
     * 账号已冻结
     */
    'freeze'                      => 2
];
